// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-08
// copyright by hoojo@2018
// --------------------------------------------------------------

/* ---------------------------------------------------------------
numeric const
==================================================================
数值常量 用来存储数值的常量对象
------------------------------------------------------------------
常量 未指定类型的常量由上下文来决定其类型
数值常量 存放高精度的数值
------------------------------------------------------------------
int 类型最大可以存储一个 64 位的整数，有时会更小
int 可以存放最大64位的整数，根据平台不同有时会更少
------------------------------------------------------------------*/

package main

import "fmt"

const (
	Big   = 1 << 100
	Small = Big >> 99
)

func main() {
	fmt.Printf("Big: %v, Small: %v \n", Big, Small)
}
