// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-08
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
defer
==================================================================
defer语句 会将函数推迟到外层函数返回之后执行。
------------------------------------------------------------------
defer语句 推迟调用的函数其参数会立即取值，但直到外层函数返回前该函数都不会被调用。
------------------------------------------------------------------
------------------------------------------------------------------*/
package main

import "fmt"

func main() {

	// 延迟执行，等待其他语句执行完成后，在main函数最后才执行本语句
	defer fmt.Println("世界！")

	fmt.Print("hello, ")
}
