// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-15
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
method
==================================================================
方法 即可用声明在结构体上，也可以在非结构体上
------------------------------------------------------------------
方法 只能为在同一包内定义的类型的接收者声明方法
方法 不能为其它包内定义的类型（包括 int 之类的内建类型）的接收者声明方法
------------------------------------------------------------------
	就是接收者的类型定义和方法声明必须在同一包内；不能为内建类型声明方法
------------------------------------------------------------------*/
package main

import "fmt"

// 定义类型，非结构体类型
type MyInt int


// 将接受者作为func 函数参数
func (v MyInt) Abs() int {

	if v > 0 {
		return  int(-v)
	}

	return int(v)
}

func main() {

	ref := MyInt(10)
	fmt.Println("abs: ", ref.Abs())
}
