// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-08
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
for - while
==================================================================
for循环 while 语句的一种变体
------------------------------------------------------------------
for循环 可以忽略前置语句、后置语句
for循环 可以忽略前置语句和后置语句的 “;”
------------------------------------------------------------------*/

package main

import (
	"fmt"
	"time"
)

func main() {

	// for 当 while 用
	sum := 1
	for sum < 10 {
		sum += sum
	}
	fmt.Println("sum: ", sum)

	i := 1
	for i <= 5 {
		fmt.Printf("time: %v \n", time.Now())
		time.Sleep(1)
		i++
	}
}
