// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-08
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
for - simple
==================================================================
for循环 简写方式，不带初始化语句或后置语句
------------------------------------------------------------------
for循环 初始化语句不是必选的，默认初始化为0
for循环 后置语句也不是必选的，当后置语句为空，循环变量不变动，会进入死循环
------------------------------------------------------------------*/

package main

import "fmt"

func main() {

	// 没有初始化和后置语句，条件语句依然有效
	sum := 1
	for ; sum < 1000; {
		// 循环变量在循环体重进行变更
		sum += sum
	}

	fmt.Printf("sum: %v", sum)
}
