// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-17
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
interface empty
==================================================================
空接口 没有任何方法的接口
------------------------------------------------------------------
空接口 可以保存任何类型的值，因为每个类型都有至少一个方法
空接口 可以用来处理未知类型的值，例如：fmt.Print 都是接收 interface 参数
------------------------------------------------------------------*/
package main

import "fmt"

func describe(i interface{}) {
	fmt.Printf("(%v, %T)\n", i, i)
}

func main() {

	// 声明一个空接口类型变量
	var i interface{}
	describe(i)		// (<nil>, <nil>)

	// 存放任意类型值
	i = 45
	describe(i)		// (45, int)

	// 存放任意类型值
	i = "hello"
	describe(i)		// (hello, string)
}
