// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-08
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
if
==================================================================
判断 条件语句，做一样条件判断处理
------------------------------------------------------------------
语法：
	if 判断条件 {
		// do something
	}
------------------------------------------------------------------
判断 条件满足 true 或者 不满足 false，为 true 执行，false 则跳过
判断 条件判断不能为其他非 bool 类型的数据
------------------------------------------------------------------*/
package main

import (
	"fmt"
	"math"
)

func sqrt(x float64) string {

	// 加入条件，处理不同的流程
	if x < 0 {
		return sqrt(-x) + "i"
	}

	return fmt.Sprint(math.Sqrt(x))
}

func main() {

	// 判断语句
	if true {
		fmt.Println("go to if process.")
	}

	i := 10
	if i < 100 {
		fmt.Println("i < 100")
	}

	fmt.Println("sqrt: ", sqrt(2))
	fmt.Println("sqrt: ", sqrt(-4))
}
