// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-08
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
if short statement
==================================================================
判断短语句 在if初始运行时可以完成一个简单的语句
------------------------------------------------------------------
语法：
	if 初始化语句; 判断条件 {
		// do something
	}
------------------------------------------------------------------
判断短语句 在短语句中的变量，只能在if结构体中访问，在if外层不能访问
------------------------------------------------------------------*/
package main

import (
	"fmt"
	"math"
)

func max(f float64, max float64) float64  {

	// 在条件语句之前运行一段短语句
	if x := math.Round(f); x < max {
		return x
	}

	// 在if外层并不能访问 x
	// fmt.Println(x)
	return max
}

func main() {

	fmt.Println("max: ", max(2.23, 10.0))
	fmt.Println("max: ", max(10.23, 10.0))
}
