// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-02
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
function return
==================================================================
函数 有返回值或没有返回值，可以同时返回多个值
------------------------------------------------------------------
函数 可以有一个或多个返回值，也可以没有返回值
函数 多个返回函数，可以返回复杂的数据模型
------------------------------------------------------------------*/

package main

import "fmt"

// 返回两个string类型值
func wrapper(a, b string) (string, string)  {

	return a, a + b
}

func main() {

	// 定义两个变量接收返回值
	aVal, bVal := wrapper("an", "na")
	fmt.Println("return data1: ", aVal, ", return data2: ", bVal)
}
