// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-02
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
function return give name 函数返回值命名
==================================================================
函数 可以有返回值，可以多个返回值，可以命名返回值
------------------------------------------------------------------
函数 返回值可被命名，它们会被视作定义在函数顶部的变量
函数 返回值的名称应当具有一定的意义，它可以作为文档使用
函数 命名的返回值将按照命名的顺序返回，在return 关键字后可以省略返回数据

函数 在长的函数中直接返回（不显示设置返回值），它们会影响代码的可读性。
------------------------------------------------------------------*/

package main

import "fmt"

// foo, boo 就是命名返回值，有类型有名称
func wrapper(a, b string) (foo, boo string)  {

	foo = b + a
	boo = a + b

	// 可以不设置具体返回值，通过命名返回值直接返回
	return
}

func main() {

	ret1, ret2 := wrapper("an", "na")
	fmt.Println("ret1: ", ret1, "ret2: ", ret2)
}
