// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-02
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
function params
==================================================================
函数 函数可以包含多个参数
------------------------------------------------------------------
函数 函数参数有多个连续的类型一致的时候，可以省略前面的参数类型，只保留最后一个参数的类型
	这种方式比多个参数都定义类型要简单清晰
------------------------------------------------------------------*/

package main

import "fmt"

// 每个参数都有一个类型定义
func sum(x int, y int, z int) int  {
	return x + y + z
}

// 和 上面的 sum 方法结果一致，但可读性高很多，看起来更简单
// 多个参数，且连续的类型一致
func add(x, y, z int) int {
	return x + y + z
}

func main() {

	fmt.Println("x + y + z = ", sum(3, 6, 9))
	fmt.Println("x + y + z = ", add(3, 6, 9))
}
