// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-09
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
slice
==================================================================
切片 一个能将数组按照起始索引位置取值区间的操作方法
------------------------------------------------------------------
语法：
	var array = [3]int { 10, 20, 30 }
	var slices = array[上界:下界] // 取到 上界 到 下界-1 的元素
------------------------------------------------------------------
切片 可以创建一个新的数组对象
切片 可以扩展或缩小数组空间大小
切片 为数组元素提供动态大小的、灵活的操作方式
切片 没有固定大小空间
切片 通过上限和下限决定空间大小，元素数量
切片 支持半开区间
切片 上界一定要小于等于下界
------------------------------------------------------------------*/

package main

import "fmt"

func main() {

	var arrays = []string { "a", "b", "c", "d", "e", "f", "g" }

	fmt.Println("arrays: ", arrays)

	// 取到下标 1 到 4 的元素，不包括下标 4
	var str []string = arrays[1:4]
	fmt.Println("str: ", str)
}
