// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-09
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
slice literals
==================================================================
切片文法 切片文法就是一个没有长度的数组形式
------------------------------------------------------------------
语法：
	[3]bool{true, true, false} 	// 数组
	[]bool {true, true, false}	// 切片文法
------------------------------------------------------------------
切片文法 在构建切片的时候用数组的形式，但是数组不设置长度，就是切片文法
------------------------------------------------------------------
------------------------------------------------------------------*/
package main

import "fmt"

func main() {

	// 切片文法形式
	ints := []int { 1, 3, 2, 5, 7 }
	fmt.Println("ints: ", ints)

	bools := []bool { true, false, true }
	fmt.Println("bools: ", bools)

	structs := []struct {
		i int
		b bool
	}{
		{2, false},
		{4, true},
		{3, true},
		{1, false},
		{ b: true }, // i 默认值 0
	}
	fmt.Println("structs: ", structs)
}
