// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-09
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
slice point
==================================================================
切片指针 切片获取的数组数据是在数组内存地址的一段引用
------------------------------------------------------------------
切片指针 修改切片数据就相当于修改原数组数据，这根指针的操作方式一样
切片指针 其他与原始数组关联的切片也会被修改
------------------------------------------------------------------*/

package main

import "fmt"

func main() {

	names := [4]string {
		"jack",
		"json",
		"tom",
		"John",
	}

	fmt.Println("names: ", names)

	a := names[0:2]
	var b []string = names[1:3]
	fmt.Println("a: ", a, ", b: ", b) // a:  [jack json] , b:  [json tom]


	// 修改 切片 的值，其他切片和原始数组的值跟着都变了
	a[1] = "XXX"
	fmt.Println("a: ", a, ", b: ", b) // a:  [jack XXX] , b:  [XXX tom]
	fmt.Println("names: ", names)
}
