// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-10
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
slice to slice
==================================================================
切片的切片 相当于是二维数组，切片中还包含切片
------------------------------------------------------------------
------------------------------------------------------------------
------------------------------------------------------------------*/
package main

import (
	"fmt"
	"strings"
)

func main() {

	arrays := [][]string {
		[]string { "_", "_", "_" },
		[]string { "_", "_", "_" },
		// make([]string, 3, 3),
		{ "_", "_", "_ "},	// 由于已经指定[][]string类型，故可以忽略
	}

	fmt.Println("arrays: ", arrays) // arrays:  [[_ _ _] [_ _ _] [_ _ _ ]]


	arrays[0][0] = "X"
	arrays[2][2] = "O"
	arrays[1][2] = "X"
	arrays[1][0] = "O"
	arrays[0][2] = "X"

	fmt.Println("arrays: ", arrays) // arrays:  [[X _ X] [O _ X] [_ _ O]]

	for i := 0; i < len(arrays); i++ {
		fmt.Printf("%s \n", strings.Join(arrays[i], " "))
	}
	// X _ X
	// O _ X
	// _ _ O
}
