// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-10
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
range
==================================================================
区间 在遍历迭代的时候可以对迭代元素进行赋值
------------------------------------------------------------------
区间 虽然每次迭代的元素是一个副本，但存在索引，可以直接通过索引改变原始数据
区间 当循环遍历不需要值的时候，可以忽略值引用的声明
区间 当循环遍历不需要索引的时候，可以用 “_” 作为占位符替代索引
------------------------------------------------------------------*/
package main

import "fmt"

func main() {

	arrays := make([]int, 5)

	// 忽略 value
	for i := range arrays {
		arrays[i] = 1 << uint(i) // 2 ** i
	}

	// _ 表示占位符，替代索引index
	for _, value := range arrays {
		fmt.Println("value: ", value)
	}
}
