// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-10
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
range
==================================================================
range赋值 range在遍历迭代的时候可以对迭代元素进行赋值
------------------------------------------------------------------
range赋值 虽然每次迭代的元素是一个副本，但存在索引，可以直接通过索引改变原始数据
------------------------------------------------------------------*/
package main

import "fmt"

func main() {

	arrays := make([]int, 5)

	for i := range arrays {
		arrays[i] = 1 << uint(i) // 2 ** i
	}

	// _ 表示占位符
	for _, value := range arrays {
		fmt.Println("value: ", value)
	}
}
