// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-10
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
range
==================================================================
区间 用于循环遍历迭代切片或数组的数据模型
------------------------------------------------------------------
语法：
	for 遍历对象索引, 遍历对象值 := range 遍历集合 {
		// do something
		// 遍历对象索引
		// 遍历对象值
	}
------------------------------------------------------------------
区间 来循环遍历的时候，每次会返回当前元素下标和当前元素的副本
区间 当循环遍历不需要索引或值的时候，还可以忽略或替代索引和值的
------------------------------------------------------------------*/
package main

import "fmt"

func main() {

	arrays := []int { 1, 3, 7, 2, 9 , 4, 5, 6, 8 }

	for index, value := range arrays {
		fmt.Printf("index: %d, value: %v \n", index, value)
	}

	// index: 0, value: 1
	// index: 1, value: 3
	// index: 2, value: 7
	// index: 3, value: 2
	// index: 4, value: 9
	// index: 5, value: 4
	// index: 6, value: 5
	// index: 7, value: 6
	// index: 8, value: 8
}
