// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-02
// copyright by hoojo@2018
// --------------------------------------------------------------

/* ---------------------------------------------------------------
var
==================================================================
变量 用于声明存储一个值，可以在适合的作用域内使用
------------------------------------------------------------------
------------------------------------------------------------------
变量 可以声明一个变量列表，跟函数的参数列表一样，类型在最后。
变量 可以出现在包或函数级别
------------------------------------------------------------------*/

package main

import "fmt"

// 没有赋值，取类型的默认值 false
var a, i, result bool

func main() {

	// 没有赋值，默认值 0
	var str int

	fmt.Println("a: ", a, ", i: ", i, ", result: ", result) // a:  false , i:  false , result:  false
	fmt.Println("str: ", str) // str:  0
}
