// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-03
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
variable short
==================================================================
短变量 声明不需要使用关键字var和数据类型，简洁高效，可读性高
------------------------------------------------------------------
短变量 在函数中，简洁赋值语句 := 可在类型明确的地方代替 var 声明。
短变量 在函数外的每个语句都必须以关键字开始（var, func 等等），因此 := 结构不能在函数外使用。
------------------------------------------------------------------*/
package main

import "fmt"

// 短变量，不能在函数外进行声明
// x := 3

func main() {

	// var 声明变量，需要变量类型
	var i, j int8 = 1, 3

	// 短变量声明不需要变量类型
	k := false

	// 同时声明多个不同类型的变量
	sum, flag, golang := 11, true, "yes"

	fmt.Println("i: ", i, ", j: ", j)
	fmt.Println("k: ", k)

	fmt.Println("sum: ", sum, ", flag: ", flag, ", golang: ", golang)
}
