// --------------------------------------------------------------
// author: hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create date: 2018-06-28
// copyright by hoojo @ 2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
quick started
==================================================================
Go 程序文件一般至少有3个部分组成，分别是package、import、main
------------------------------------------------------------------
package 包，组织当前程序的分类模块
import 	引入包，将当前程序需要的包引入到程序中
main 	主函数，作为一个运行的入口点
------------------------------------------------------------------*/

package main

import "fmt"

func main() {
	fmt.Println("hallo, 世界！")
}
