// --------------------------------------------------------------
// author:   hoojo
// email:    hoojo_@126.com
// github:   https://github.com/hooj0
// create:   2018-07-24
// copyright by hoojo@2018
// --------------------------------------------------------------



/* ---------------------------------------------------------------
channel buffer
==================================================================
通道缓冲区 在构建通道时，可以为make函数传递一个长度length 设定缓冲区大小
------------------------------------------------------------------
语法：
	ch := make(chan int, 100)
------------------------------------------------------------------
通道缓冲区 仅当缓冲区存满后，向通道发送数据才会阻塞
通道缓冲区 为空的时候，接收方会阻塞，等待缓冲区有数据能被接收
------------------------------------------------------------------
缓冲区就像一个水池，在蓄水（发送数据）的时候，如果水池满了，就需要等待能蓄水的时候才能进行蓄水
而在取水（接收数据）的时候，如果水池是干的，则需要等待有水的时候才能取水
------------------------------------------------------------------*/
package main

import "fmt"

func main() {

	ch := make(chan int, 2)
	ch <- 1		// 蓄水，装入数据
	ch <- 2		// 蓄水，填充数据

	fmt.Println(<- ch)	// 取水，接收数据
	fmt.Println(<- ch)	// 取水，拉取数据
	// fmt.Println(<- ch)	// 取水，拉取数据... fatal error: all goroutines are asleep - deadlock!
}
